# View Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Dimension..::..View Property
Dimension Class See Also
---
Supplies the view that contains the dimension if the dimension is view specific.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public View View { get; }
```

Visual Basic
---
```text
Public ReadOnly Property View As View
	Get
```

Visual C++
---
```text
public:
property View^ View {
	View^ get ();
}
```

# See Also
Dimension Class
Autodesk.Revit.DB Namespace